## MERGing

### Sample DataFrames

In [9]:
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [12]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

#### MERGE/ INNER JOIN

In [15]:
pd.merge(employees , departments, on = "DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

#### LEFT Inner Join

In [20]:
pd.merge(employees, departments, on = "DeptID", how = "left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

#### RIGHT Inner Join

In [23]:
pd.merge(employees, departments, on = "DeptID", how = "right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

#### OUTER Join

In [26]:
pd.merge(employees, departments, on = "DeptID", how = "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

## CONCAT

In [32]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

df1

    Name
0  Alice
1    Bob

In [34]:
df2

      Name
0  Charlie
1    David

In [36]:
pd.concat([df1, df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [42]:
pd.concat([df1, df2], axis = 1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [48]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "Score":[45,51]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "ID":[1,5]})

df1

    Name  Score
0  Alice     45
1    Bob     51

In [50]:
df2

      Name  ID
0  Charlie   1
1    David   5

In [52]:
pd.concat([df1, df2])

      Name  Score   ID
0    Alice   45.0  NaN
1      Bob   51.0  NaN
0  Charlie    NaN  1.0
1    David    NaN  5.0

In [56]:
pd.concat([df1, df2], axis = 1)

    Name  Score     Name  ID
0  Alice     45  Charlie   1
1    Bob     51    David   5